// Lorem Text Generation
var banglaLorem = [
"গাছতলায় দিব্যি ছায়ার মধ্যে চুপচাপ শুয়ে আছি তবু ঘেমে অস্থির ঘাসের উপর রুমালটা ছিল ঘাম মুছবার জন্য যেই সেটা",
"তুলতে গিয়েছি অমনি রুমালটা বলল ম্যাও কি আপদ রুমালটা ম্যাও করে কেন চেয়ে দেখি রুমাল তো আর রুমাল নেই দিব্যি", 
"মোটা সোটা লাল টক্‌টকে একটা বেড়াল গোঁফ ফুলিয়ে প্যাট্‌ প্যাট্‌ করে আমার দিকে তাকিয়ে আছে আমি বললাম কি মুশকিল", 
"ছিল রুমাল হয়ে গেল একটা বেড়াল অমনি বেড়ালটা বলে উঠল মুশকিল আবার কি ছিল একটা ডিম হয়ে গেল একটা প্যাঁকপ্যাঁকে", 
"হাঁস এ তো হামেশাই হচ্ছে আমি খানিক ভেবে বললাম তাহলে তোমায় এখন কি বলে ডাকব তুমি তো সত্যিকারের বেড়াল নও",
"আসলে তুমি হচ্ছ রুমাল বেড়াল বলল বেড়ালও বলতে পার রুমালও বলতে পার চন্দ্রবিন্দুও বলতে পার আমি বললাম চন্দ্রবিন্দু কেন",
"বেড়াল বলল তাও জানো না বলে এক চোখ বুজে ফ্যাঁচ্‌ ফ্যাঁচ্‌ করে বিশ্রী রকম হাসতে লাগল আমি ভারি অপ্রস্তুত হয়ে গেলাম মনে",
"হল ঐ চন্দ্রবিন্দুর কথাটা নিশ্চই আমার বোঝা উচিৎ ছিল তাই থতমত খেয়ে তাড়াতাড়ি বলে ফেললাম ও হ্যাঁ হ্যাঁ বুঝতে পেরেছি", 
"বেড়ালটা খুশি হয়ে বলল হ্যাঁ এ তো বোঝাই যাচ্ছে চন্দ্রবিন্দুর চ বেড়ালের তালব্য শ আর রুমালের মা হল চশমা কেমন হল তো",
"আমি কিছুই বুঝতে পারলাম না কিন্তু পাছে বেড়ালটা আবার সেই রকম বিশ্রী করে হেসে ওঠে তাই সঙ্গে সঙ্গে হুঁ হুঁ করে গেলাম",
"তারপর বেড়ালটা খানিকক্ষণ আকাশের দিকে তাকিয়ে হঠাৎ বলে উঠল গরম লাগে তো তিব্বত গেলেই পার আমি বললাম কিন্তু বললেই", 
"তো আর যাওয়া যায় না বেড়াল বলল কেন সে আর মুশকিল কি আমি বললাম কি করে যেতে হয় তুমি জানো বেড়াল একগাল হেসে",
"বলল তা আর জানিনে কলকেতা ডায়মন্ড হারবার রানাঘাট তিব্বত ব্যাস্‌ সিধে রাস্তা সওয়া ঘণ্টার পথ গেলেই হল আমি বললাম তাহলে",
"রাস্তাটা আমায় বাতলে দিতে পার শুনে বেড়ালটা কেমন গম্ভীর হয়ে গেল তারপর মাথা নেড়ে বলল উহুঁ সে আমার কর্ম নয় আমার", 
"গেছোদাদা যদি থাকত তাহলে সে ঠিক বলতে পারত আমি বললাম গেছো দাদা কে তিনি থাকেন কোথায় বেড়াল বলল গেছো দাদা আবার", 
"কোথায় থাকবে গাছেই থাকে আমি বললাম কোথায় তাঁর সঙ্গে দেখা হয় বেড়াল খুব জোরে জোরে মাথা নেড়ে বলল সেটি হচ্ছে না সে হবার",
"যো নেই আমি বললাম কি রকম বেড়াল বলল সে কি রকম জানো মনে কর তুমি যখন যাবে উলুবেড়ে তাঁর সঙ্গে দেখা করতে তখন তিনি", 
"থাকবেন মতিহারি যদি মতিহারি যাও তাহলে শুনবে তিনি আছেন রামকিষ্টপুর আবার সেখানে গেলে দেখবে তিনি গেলেন কাশিমবাজার কিছুতেই", 
"দেখা হবার যো নেই আমি বললাম তাহলে তোমরা কি করে দেখা কর বেড়াল বলল সে অনেক হাঙ্গামা আগে হিসেব করে দেখতে হবে দাদা",
"কোথায় কোথায় নেই তারপর হিসেব করে দেখতে হবে দাদা কোথায় কোথায় থাকতে পারে তারপর দেখতে হবে দাদা এখন কোথায় আছে তারপর", 
"দেখতে হবে সেই হিসেব মতো যখন সেখানে গিয়ে পৌঁছব তখন দাদা কোথায় থাকবে তারপর দেখতে হবে আমি তাড়াতাড়ি বাধা দিয়ে বললাম",
"সে কি রকম হিসেব বেড়াল বলল সে ভারি শক্ত দেখবে কি রকম এই বলে সে একটা কাঠি দিয়ে ঘাসের উপর লম্বা আঁচড় কেটে বলল এই মনে", 
"কর গেছোদাদা বলেই খানিকক্ষণ গম্ভীর হয়ে চুপ করে বসে রইল তারপর আবার ঠিক তেমনি আঁচড় কেটে বললএই মনে কর তুমি বলে ঘাড় বেঁকিয়ে", 
"চুপ করে রইল তারপর হঠাৎ আবার একটা আঁচড় কেটে বলল এই মনে কর চন্দ্রবিন্দু এমনি করে খানিকক্ষণ কি ভাবে আর একটা করে লম্বা আঁচড়", 
"কাটে আর বলে এই মনে কর তিব্বত এই মনে কর গেছোবৌদি রান্না করছে এই মনে কর গাছের গায়ে একটা ফুটো এই রকম শুনতে শুনতে শেষটায়",
"আমার কেমন রাগ ধরে গেল আমি বললাম দূর ছাই কি সব আবোল তাবোল বকছ একটুও ভালো লাগে না বেড়াল বলল আচ্ছা তাহলে আর একটু সহজ", 
"করে বলছি চোখ বোজ আমি যা বলব মনে মনে তার হিসেব কর আমি চোখ বুজলাম চোখ বুজেই আছি বুজেই আছি বেড়ালের আর কোন সাড়া শব্দ নেই", 
"হঠাৎ কেমন সন্দেহ হল চোখ চেয়ে দেখি বেড়ালটা ল্যাজ খাড়া করে বাগানের বেড়া টপকিয়ে পালাচ্ছে আর ক্রমাগত ফ্যাঁচ্‌ ফ্যাঁচ্‌ করে হাসছে কি আর করি", 
"গাছ তলায় একটা পাথরের উপর বসে পড়লাম বসতেই কে যেন ভাঙা মোটা গলায় বলে উঠল সাত দুগুণে কত হয় আমি ভাবলাম এ আবার কে রে এদিক",
"ওদিক তাকাচ্ছি এমন সময় আবার সেই আওয়াজ হল কই জবাব দিচ্ছ না যে সাত দুগুণে কত হয় তখন উপর দিকে তাকিয়ে দেখি একটা দাঁড়কাক শ্লেট",
"পেনসিল দিয়ে কি যেন লিখছে আর এক একবার ঘাড় বেঁকিয়ে আমার দিকে তাকাচ্ছে আমি বললাম সাত দুগুণে চোদ্দ কাকটা অমনি দুলে দুলে",
"মাথা নেড়ে বলল হয়নি হয়নি ফেল্‌ আমার ভয়ানক রাগ হল বললাম নিশ্চয় হয়েছে সাতেক্কে সাত সাত দুগুণে চোদ্দ তিন সাত্তে একুশ", 
"কাকটা কিছু জবাব দিল না খালি পেনসিল মুখে দিয়ে খানিকক্ষণ কি যেন ভাবল তারপরে বলল সাত দুগুণে চোদ্দর নামে চার হাতে রইল পেনসিল", 
"আমি বললাম তবে যে বলছিলে সাত দুগুণে চোদ্দ হয় না এখন কেন কাক বলল তুমি যখন বলেছিলে তখনো পুরো চোদ্দ হয়নি তখন ছিল তেরো টাকা", 
"চোদ্দ আনা তিন পাই আমি যদি ঠিক সময়ে বুঝে ধাঁ করে ১৪ লিখে না ফেলতাম তাহলে এতক্ষণে হয়ে যেত চোদ্দ টাকা এক আনা নয়", 
"পাই আমি বললাম এমন আনাড়ি কথা তো কখনো শুনিনি সাত দুগুণে যদি চোদ্দ হয় তা সে সব সময়েই চোদ্দ একঘণ্টা আগে হলেও", 
"যা দশ দিন পরে হলেও তাই কাকটা ভারি অবাক হয়ে বলল তোমাদের দেশে সময়ের দাম নেই বুঝি আমি বললাম সময়ের দাম কি রকম", 
"কাক বলল এখানে কদিন থাকতে তাহলে বুঝতে আমাদের বাজারে সময় এখন ভয়ানক মাগ্যি এতটুকু বাজে খরচ করবার যো নেই",
"এইতো কদিন আগে খেটেখুটে চুরিচামারি করে খানিকটা সময় জমিয়েছিলাম তাও তোমার সঙ্গে তর্ক করতে করতে অর্ধেক খরচ হয়ে গেল",
"এমন সময় হঠাৎ গাছের একটা ফোকর থেকে কি যেন একটা সুড়ুৎ করে পিছলিয়ে মাটিতে নামল চেয়ে দেখি দেড় হাত লম্বা এক বুড়ো",
"তার পা পর্যন্ত সবুজ রঙের দাড়ি হাতে একটা হুঁকো তাতে কলকে টলকে কিচ্ছু নেই আর তার মাথা ভরা টাক",
//You can add more sentences here
];

document.getElementById("ctc").style.display="none";

$(document).ready(function() {
initbutton();
});

function initbutton(){
$('#generate').on('click', function(){
cleardisplay();
speak();
document.getElementById("ctc").style.display="block";
});
}

function cleardisplay(){
$('#display').empty();
}

function speak(){
var num = parseInt($('#num').val());
var typ = $('#typ').val();
if(typ === 'w'){
createwords(num);
}
else if(typ ==='s'){
createsentences(num);
}
else{/*If drop down fails default to paragraphs*/
createparagraphs(num);
}
}
function createsentences(n){
for(var i = 0; i <= (n - 1); i++){
var r = Math.floor(Math.random() * banglaLorem.length);
var sent = "<p>" + banglaLorem[r] + '।' + "</p>";
$('#display').append(sent);
}
}

function createparagraphs(n){
for(var i = 0; i <= (n - 1); i++){
var para = '<p>';
for(var j = 0; j <= 4; j++){
var r = Math.floor(Math.random() * banglaLorem.length);
para = para + banglaLorem[r] + '। ';
}
para = para + '</p>';
$('#display').append(para);
}
}

function createwords(n){

var combinedwords = '<p>';

for(var i = 0; i <= (n - 1); i++){
var a = Math.floor(Math.random() * banglaLorem.length);
var splitsent = banglaLorem[a].split(' ');
var b = Math.floor(Math.random() * splitsent.length);
combinedwords = combinedwords + splitsent[b] + ' ';
}
$('#display').append(combinedwords + '</p>');
}

// Copy to Clipboard
function copyToClip(){
  console.time('time1');
	var temp = $("<input>");
  $("body").append(temp);
 temp.val($('#display').text()).select();
  document.execCommand("copy");
  temp.remove();
    console.timeEnd('time1');
  $('#copied-success').fadeIn(1200);
  $('#copied-success').fadeOut(1200);
}




